#ifndef QUIZMODEL_H
#define QUIZMODEL_H

#include <QObject>

#include <vector>
#include <utility>
#include <unordered_set>

class QuizModel
{
public:
    QuizModel();

    std::vector<std::pair<QString,QString> > getQuizQuestions(const std::vector<QString>& values)const;

    std::vector<QString> values1 = {"Статус(положение)","Исследование(Поиск)","Безопасность(защита)","Удовольствие(довольство)",
                                    "Принадлежность(причастность)","Заметность(внимание)","Самоактуализация(совершенствование)"};
    std::vector<QString> values2 = {"Признание(честь)","Познание(изучение)","Порядок(организованность)",
                                    "Комфорт(удобство)","Принятие(приязнь)","Обшение(контакты)","Самоатуализация"};
    std::vector<QString> values3 = {"Доверие(уверенность)","Понимание(осознание)","Уважение(значимость)","Свобода(независимость)",
                                    "Идентичность(соответствие себе)","Привязанность(близость)","Самоактуализация"};
    std::vector<QString> values4 = {"Смысл(схватывание сути)","Власть(возможности)","Любовь","Помощь(поддержка)",
                                    "Истина(правда)","Счастье(благо)","Самоактуализация"};
};

#endif // QUIZMODEL_H
